app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows` FROM `users`
---
    public function index()
    {
        $data = [
            'totalServices' => $this->serviceModel->countAll(),
            'totalUsers'    => $this->userModel->countAll(),
        ];

UPDATE `absen` SET `tipe` = 'Hadir'
WHERE `id_user` = '75'
---
    public function change_absen($tipe, $id_user)
    {
        $this->absenModel->where('id_user', $id_user)->set('tipe', $tipe)->update();