app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'kasir'
 LIMIT 1
---
  public function dologin()
  {
    $userModel = new UserModel();
    $session = session();

    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');

    $user = $userModel->where('username', $username)->first();