app/Controllers/Kasir.php

SELECT *
FROM `absen`
WHERE `id_user` = '79'
AND  `jam` LIKE '%2025-05-31%' ESCAPE '!'
 LIMIT 1
---
    public function absenHadir($tipe = NULL)
    {
        $absen = $this->absenModel
            ->where([
                'id_user' => session('id_user'),
            ])
            ->like('jam', Time::now('Asia/Makassar')->toDateString()) // Cek apakah kolom 'jam' mengandung tanggal hari ini
            ->first();

SELECT `tblinvoice`.*, `users`.`username`, `users`.`email`, `tblservices`.`ServiceName`
FROM `tblinvoice`
LEFT JOIN `users` ON `users`.`id_user` = `tblinvoice`.`id_user`
LEFT JOIN `tblservices` ON `tblservices`.`id_service` = `tblinvoice`.`id_service`
---
    public function invoiceList()
    {
        $invoices = $this->invoiceModel
            ->select('tblinvoice.*, users.username, users.email, tblservices.ServiceName')
            ->join('users', 'users.id_user = tblinvoice.id_user', 'left')
            ->join('tblservices', 'tblservices.id_service = tblinvoice.id_service', 'left')
            ->findAll();

SELECT *
FROM `pembelian`
JOIN `users` ON `users`.`id_user` = `pembelian`.`id_user`
JOIN `tblproduk` ON `tblproduk`.`id_produk` = `pembelian`.`id_produk`
WHERE `id_invoiceproduk` = '1'
---
    public function detailInvoiceProduk($id)
    {
        $pembelianModel = new \App\Models\PembelianModel();
        $data = [
            'id_invoiceproduk' => $id,
            'data' => $pembelianModel
                ->where('id_invoiceproduk', $id)
                ->join('users', 'users.id_user = pembelian.id_user')
                ->join('tblproduk', 'tblproduk.id_produk = pembelian.id_produk')
                ->findAll(),