app/Controllers/Kasir.php

SELECT COUNT(*) AS `numrows` FROM `users`
---
    public function index()
    {
        $data = [
            'totalServices' => $this->layananModel->countAll(),
            'totalUsers'    => $this->userModel->countAll(),
        ];

SELECT *
FROM `users`
WHERE `role` = 'member'
---
    public function pelanggan()
    {
        $data['users'] = $this->userModel->where('role', 'member')->findAll();

SELECT *
FROM `nonmember`
---
    public function nonpelanggan()
    {
        $data['data'] = $this->Nonmember->findAll();

INSERT INTO `nonmember` (`id_pegawai`, `id_service`, `ciri`, `tanggal`) VALUES ('2', '27', 'sd', '2025-06-07T03:21')
---
    public function storeNonMember()
    {
        try {
            $data = [
                'id_pegawai' => $this->request->getPost('id_pegawai'),
                'id_service' => $this->request->getPost('id_service'),
                'ciri' => $this->request->getPost('ciri'),
                'tanggal' => $this->request->getPost('tanggal'),
            ];

            $this->Nonmember->insert($data);

UPDATE `nonmember` SET `id_pegawai` = '2', `id_service` = '26', `ciri` = 'sdsad', `tanggal` = '2025-06-07T03:21'
WHERE `nonmember`.`id_nonmember` IN ('1')
---
    public function updateNonMember($id)
    {
        try {
            $data = [
                'id_pegawai' => $this->request->getPost('id_pegawai'),
                'id_service' => $this->request->getPost('id_service'),
                'ciri' => $this->request->getPost('ciri'),
                'tanggal' => $this->request->getPost('tanggal'),
            ];

            $this->Nonmember->update($id, $data);