app/Models/Absen.php

     public function getAllAbsensi()
    {
        return $this->select('absen.*, users.username')
                    ->join('users', 'users.id_user = absen.id_user')
                    ->orderBy('jam', 'DESC')
                    ->findAll();
---
SELECT `absen`.*, `users`.`username`
FROM `absen`
JOIN `users` ON `users`.`id_user` = `absen`.`id_user`
ORDER BY `jam` DESC